In [1]:
import pandas as pd
import numpy as np

In [4]:
series = pd.Series(["John", "Carl", "Susan"])
series

0     John
1     Carl
2    Susan
dtype: object

In [5]:
names = pd.Series(["John", "Carl", "Susan"])
age = pd.Series([23, 50, 35])
gender = pd.Series(["M", "M", "F"])

In [6]:
people_data = pd.DataFrame({"Name":names, "Age":age, "Gender":gender})
people_data

    Name  Age Gender
0   John   23      M
1   Carl   50      M
2  Susan   35      F

Check the location of datasets

In [12]:
! ls ../datasets

_backup_sentiment_data.csv
_backup_spotify_songs.csv
sentiment_data.csv
spotify_songs.csv

In [19]:
sentiment_dataset = pd.read_csv("../datasets/sentiment_data.csv")

In [20]:
sentiment_dataset.head()

,Unnamed: 0,textID,text,selected_text,sentiment,Time of Tweet,Age of User,Country,Population -2020,Land Area (Km²),Density (P/Km²)
0,0,cb774db0d1,"I`d have responded, if I were going","I`d have responded, if I were going",neutral,morning,0-20,Afghanistan,38928346.0,652860.0,60.0
1,1,549e992a42,Sooo SAD I will miss you here in San Diego!!!,Sooo SAD,negative,noon,21-30,Albania,2877797.0,27400.0,105.0
2,2,088c60f138,my boss is bullying me...,bullying me,negative,night,31-45,Algeria,43851044.0,2381740.0,18.0
3,3,9642c003ef,what interview! leave me alone,leave me alone,negative,morning,46-60,Andorra,77265.0,470.0,164.0
4,4,358bd9e861,"Sons of ****, why couldn`t they put them on t...","Sons of ****,",negative,noon,60-70,Angola,32866272.0,1246700.0,26.0